/*************************************************************************
	> File Name: 2.c
	> Author: snowflake
	> Mail: ︿(￣︶￣)︿
	> Created Time: 2018年07月18日 星期三 09时31分53秒
 ************************************************************************/

#include <stdio.h>

int main() {
    int f[3] = {1, 1, 2};
    int sum = 0;
    int i = 3;
    while (f[i % 3] < 4000000) {
        f[i % 3] = f[(i + 1) % 3] + f[(i + 2) % 3];
        i++;
        if (!(f[i % 3] & 1)) sum += f[i % 3];
    }
    printf("%d\n", sum);
    return 0;
}
